/*

This module prints text to screen

Entry points:

    DISP_PRINTC - prints char, x, y in stack, disp addr, char in r0, r1

*/

#include <devices.h>
#include <display_print.h>
#include <devices/display.h>
#include <call.h>

#define FONT_OFFSET 0x70

asect DISP_PRINTC
    addsp 1
    pop r2
    pop r3
    addsp -3
    push r3
    push r2
    addsp 2
    pop r3
    addsp 2
    push r3
    addsp -4
    pop r3
    pop r2
    addsp 2
    br func_printc

asect DISP_CODE

//  r0 - display address
//  r1 - char
//  r2 - x
//  r3 - y

func_printc:

    push r2
    push r3

    ldi r2, -48
    add r2, r1
    move r1, r2
    add r2, r1
    add r2, r1
    ldi r2, FONT_OFFSET
    add r2, r1

    ldc r1, r2

    st r0, r2

    pop r3
    pop r2

    st r0, r3
    st r0, r2

    ldi r2, CMD_WRITE_BLOCK_RGB

    st r0, r2

    jsr repeat
    jsr repeat
    br exit

repeat:
    inc r1

    ldc r1, r2

    st r0, r2

    ld r0, r2
    inc r2
    st r0, r2
    ld r0, r2
    st r0, r2
    ld r0, r2
    st r0, r2

    rts

func_prints:
    mret

exit:
    mret


asect FONT_OFFSET

// Digits / Цифры 
dc 0b00011111, 0b00010001, 0b00011111 // Символ 48  <0> 
dc 0b00001001, 0b00011111, 0b00000001 // Символ 49  <1> 
dc 0b00010111, 0b00010101, 0b00011101 // Символ 50  <2> 
dc 0b00010101, 0b00010101, 0b00011111 // Символ 51  <3> 
dc 0b00011100, 0b00000100, 0b00011111 // Символ 52  <4> 
dc 0b00011101, 0b00010101, 0b00010111 // Символ 53  <5> 
dc 0b00011111, 0b00010101, 0b00010111 // Символ 54  <6> 
dc 0b00010000, 0b00010000, 0b00011111 // Символ 55  <7> 
dc 0b00011111, 0b00010101, 0b00011111 // Символ 56  <8> 
dc 0b00011101, 0b00010101, 0b00011111 // Символ 57  <9> 

dc 0b00000000, 0b00001010, 0b00000000 // Символ 58  <:> 
dc 0b00000001, 0b00001010, 0b00000000 // Символ 59  <;> 
dc 0b00000100, 0b00001010, 0b00000000 // Символ 60  <<> 
dc 0b00001010, 0b00001010, 0b00001010 // Символ 61  <=> 
dc 0b00000000, 0b00001010, 0b00000100 // Символ 62  <>> 
dc 0b00010000, 0b00010101, 0b00011100 // Символ 63  <?> 
dc 0b00000100, 0b00001010, 0b00000110 // Символ 64  <@> 

// Roman Capitals / Латиница, прописные 
dc 0b00001111, 0b00010010, 0b00001111 // Символ 65  <A> 
dc 0b00011111, 0b00010101, 0b00001010 // Символ 66  <B> 
dc 0b00011111, 0b00010001, 0b00010001 // Символ 67  <C> 
dc 0b00011111, 0b00010001, 0b00001110 // Символ 68  <D> 
dc 0b00011111, 0b00010101, 0b00010001 // Символ 69  <E> 
dc 0b00011111, 0b00010100, 0b00010000 // Символ 70  <F> 
dc 0b00001111, 0b00010001, 0b00010010 // Символ 71  <G> 
dc 0b00011111, 0b00000100, 0b00011111 // Символ 72  <H> 
dc 0b00010001, 0b00011111, 0b00010001 // Символ 73  <I> 
dc 0b00010001, 0b00011111, 0b00010000 // Символ 74  <J> 
dc 0b00011111, 0b00000100, 0b00011011 // Символ 75  <K> 
dc 0b00011111, 0b00000001, 0b00000001 // Символ 76  <L> 
dc 0b00011111, 0b00001000, 0b00011111 // Символ 77  <M> 
dc 0b00011111, 0b00001110, 0b00011111 // Символ 78  <N> 
dc 0b00001110, 0b00010001, 0b00001110 // Символ 79  <O> 
dc 0b00011111, 0b00010100, 0b00001000 // Символ 80  <P> 
dc 0b00001100, 0b00010010, 0b00001101 // Символ 81  <Q> 
dc 0b00011111, 0b00010100, 0b00001011 // Символ 82  <R> 
dc 0b00001001, 0b00010101, 0b00010010 // Символ 83  <S> 
dc 0b00010000, 0b00011111, 0b00010000 // Символ 84  <T> 
dc 0b00011110, 0b00000001, 0b00011110 // Символ 85  <U> 
dc 0b00011100, 0b00000011, 0b00011100 // Символ 86  <V> 
dc 0b00011111, 0b00000010, 0b00011111 // Символ 87  <W> 
dc 0b00011011, 0b00000100, 0b00011011 // Символ 88  <X> 
dc 0b00011000, 0b00000111, 0b00011000 // Символ 89  <Y> 
dc 0b00010011, 0b00010101, 0b00011001 // Символ 90  <Z> 

end.
